Airline safety data:
analyze the number of accidents over a period of time, the number of kilometers flown and the number of incidents

safety data appears to the split into two time periods. 1985-1999 and 2000-2014
the kilometers flown are not broken up by these date ranges

In [9]:
import pandas as pd
import numpy as np

In [10]:
url = 'https://raw.githubusercontent.com/fivethirtyeight/data/master/airline-safety/airline-safety.csv'

airline_safety = pd.read_csv(url)

In [11]:
airline_safety.columns

Index(['airline', 'avail_seat_km_per_week', 'incidents_85_99',
       'fatal_accidents_85_99', 'fatalities_85_99', 'incidents_00_14',
       'fatal_accidents_00_14', 'fatalities_00_14'],
      dtype='object')

In [12]:
airline_safety.shape

(56, 8)

In [13]:
airline_safety.isnull().sum()

airline                   0
avail_seat_km_per_week    0
incidents_85_99           0
fatal_accidents_85_99     0
fatalities_85_99          0
incidents_00_14           0
fatal_accidents_00_14     0
fatalities_00_14          0
dtype: int64

a quick summary of the columns shows that the number of incidence fatal accidents and fatalities have all decreased in 2000-2014 when compared to 1985-1999

In [14]:
airline_safety.sum()

airline                   Aer LingusAeroflot*Aerolineas ArgentinasAerome...
avail_seat_km_per_week                                          77538793065
incidents_85_99                                                         402
fatal_accidents_85_99                                                   122
fatalities_85_99                                                       6295
incidents_00_14                                                         231
fatal_accidents_00_14                                                    37
fatalities_00_14                                                       3109
dtype: object

Overall there was a 23% decrease in the number of fatal accidents between the time periods.

In [15]:
col = airline_safety.columns
(airline_safety[col[6]].sum() / (airline_safety[col[3]].sum() + airline_safety[col[6]].sum()))*100

23.270440251572328

and there was a 36% decrease in the number of incidents between the time periods

In [16]:
(airline_safety[col[5]].sum() / (airline_safety[col[2]].sum() + airline_safety[col[5]].sum()))*100

36.492890995260666

create a dataframe with the calculated totals for each category

In [40]:
airline_safety['total_incidents'] = airline_safety[col[2]] + airline_safety[col[5]]
airline_safety['total_fatal_accidents'] = airline_safety[col[3]] + airline_safety[col[6]]
airline_safety['fatalities'] = airline_safety[col[4]] + airline_safety[col[7]]
airline_safety.head()

,airline,avail_seat_km_per_week,incidents_85_99,fatal_accidents_85_99,fatalities_85_99,incidents_00_14,fatal_accidents_00_14,fatalities_00_14,total_incidents,total_fatal_accidents,fatalities
0,Aer Lingus,320906734,2,0,0,0,0,0,2,0,0
1,Aeroflot*,1197672318,76,14,128,6,1,88,82,15,216
2,Aerolineas Argentinas,385803648,6,0,0,1,0,0,7,0,0
3,Aeromexico*,596871813,3,1,64,5,0,0,8,1,64
4,Air Canada,1865253802,2,0,0,2,0,0,4,0,0

In [44]:
safety_total = airline_safety[['airline', 'total_incidents', 'total_fatal_accidents', 'fatalities']]
safety_total.head()

                 airline  total_incidents  total_fatal_accidents  fatalities
0             Aer Lingus                2                      0           0
1              Aeroflot*               82                     15         216
2  Aerolineas Argentinas                7                      0           0
3            Aeromexico*                8                      1          64
4             Air Canada                4                      0           0

the airline with the most incidents over the entire period 1985-2014 
the airline with the most fatal accidents over the entire period 1985-2014

Aeroflot had the most incidents and the most fatal accidents over the entire period of 1985-2014. 82 incindents and 15 fatal accidents

In [45]:
safety_total.sort_values('total_fatal_accidents', ascending=False)[:3]

                  airline  total_incidents  total_fatal_accidents  fatalities
1               Aeroflot*               82                     15         216
19     Delta / Northwest*               48                     14         458
51  United / Continental*               33                     10         428

In [47]:
safety_total.sort_values('total_incidents', ascending=False)[:3]

               airline  total_incidents  total_fatal_accidents  fatalities
1            Aeroflot*               82                     15         216
19  Delta / Northwest*               48                     14         458
11           American*               38                      8         517

create a new dataframe with only the stats from 1985-1999

In [30]:
safety_85_99 = airline_safety[['airline', 'incidents_85_99', 'fatal_accidents_85_99', 'fatalities_85_99']]
safety_85_99.head()

,airline,incidents_85_99,fatal_accidents_85_99,fatalities_85_99
0,Aer Lingus,2,0,0
1,Aeroflot*,76,14,128
2,Aerolineas Argentinas,6,0,0
3,Aeromexico*,3,1,64
4,Air Canada,2,0,0

create a new dataframe with only the stats from 2000-20174

In [31]:
safety_00_14 = airline_safety[['airline', 'incidents_00_14', 'fatal_accidents_00_14', 'fatalities_00_14']]
safety_00_14.head()

,airline,incidents_00_14,fatal_accidents_00_14,fatalities_00_14
0,Aer Lingus,0,0,0
1,Aeroflot*,6,1,88
2,Aerolineas Argentinas,1,0,0
3,Aeromexico*,5,0,0
4,Air Canada,2,0,0

The airline with the most incidents & fatal accidents in 1985-1999 was Aerflot

The airline with the most incidents in 2000-2014 was Delta/Northwest
The airline with the most fatal accidents in 2000-2014 was American

In [34]:
safety_85_99.sort_values('incidents_85_99', ascending=False).head()

,airline,incidents_85_99,fatal_accidents_85_99,fatalities_85_99
1,Aeroflot*,76,14,128
22,Ethiopian Airlines,25,5,167
19,Delta / Northwest*,24,12,407
11,American*,21,5,101
51,United / Continental*,19,8,319

In [35]:
safety_85_99.sort_values('fatal_accidents_85_99', ascending=False).head()

,airline,incidents_85_99,fatal_accidents_85_99,fatalities_85_99
1,Aeroflot*,76,14,128
19,Delta / Northwest*,24,12,407
51,United / Continental*,19,8,319
52,US Airways / America West*,16,7,224
16,China Airlines,12,6,535

In [37]:
safety_00_14.sort_values('incidents_00_14', ascending=False).head()

,airline,incidents_00_14,fatal_accidents_00_14,fatalities_00_14
19,Delta / Northwest*,24,2,51
11,American*,17,3,416
51,United / Continental*,14,2,109
52,US Airways / America West*,11,2,23
40,Saudi Arabian,11,0,0

In [36]:
safety_00_14.sort_values('fatal_accidents_00_14', ascending=False).head()

,airline,incidents_00_14,fatal_accidents_00_14,fatalities_00_14
11,American*,17,3,416
34,Malaysia Airlines,3,2,537
35,Pakistan International,10,2,46
24,Garuda Indonesia,4,2,22
52,US Airways / America West*,11,2,23